blog-posts/2005-01-04-planner-cited-as-a-reason-to-defect-to-emacs-plannermodemaintenancegoodkarmanote2goodkarma2.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Planner cited as a reason to defect to Emacs</title>
<!-- 2015-10-19 Mon 14:08 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<link rel="stylesheet" type="text/css" href="../css/foundation.min.css"></link>
<link href='http://fonts.googleapis.com/css?family=Open+Sans' rel='stylesheet' type='text/css'></link>
<link rel="stylesheet" type="text/css" href="../css/org-export.css"></link>
<link rel="stylesheet" type="text/css" href="../css/style.css"></link>
<link rel="stylesheet" type="text/css" href="../css/emacs-notes.css"></link>
</head>
<body>
<div id="content">
<h1 class="title">Planner cited as a reason to defect to Emacs</h1>
<p>
January 4th, 2005 -
<a href="http://sachachua.com/blog/p/2542"><a href="http://sachachua.com/blog/p/2542">http://sachachua.com/blog/p/2542</a></a>
</p>

<p>
(PlannerModeMaintenance”<i>GoodKarma:2</i>)
</p>

<blockquote>
<p>
You point is well taken. I find myself living in an application more
and more. At work, it's my editor
 and I'd like it to handle the G.T.D. tasks and my schedule. I never
set out to do this, I've just seen it
 happening.
</p>
</blockquote>

<p>
Tyler will probably love being able to create hyperlinked tasks from
anywhere. =)
</p>

<p>
<a href="http://praytothemachine.com/evil/index.php?p=13">praytothemachine Ã‚Â»
Should I defect to Emacs?</a>
</p>

<p>
On Technorati: <a href="http://www.technorati.com/tag/happy">happy</a>,
<a href="http://www.technorati.com/tag/planner">planner</a>
</p>
</div>
<div id="postamble" class="status">
<div class="back-to-top"><a href="#top">Back to top</a> | <a href="mailto:sacha@sachachua.com">E-mail me</a></div>
</div>
</body>
</html>
